Merge branch 'docs/mermaid-diagrams'
